* >Natural Source Code: POENTR
* PROGRAM: POENTR - PURCHASE ORDER ENTRY (ONLINE)
* DESCRIPTION: INTERACTIVE PO CREATION SCREEN
*              SUPPLIER SELECTION -> LINE ITEMS -> APPROVAL
* LIBRARY: RETAILCORE
* ADABAS FILES: 131 (PO-HEADER), 132 (PO-LINE)
* CREATED: 2001-09-15  A. GARCIA
* MODIFIED: 2007-03-10 - ADDED AUTO-APPROVAL
* MODIFIED: 2014-08-22 - ADDED REPLENISHMENT LINK
* MODIFIED: 2020-05-15 - ADDED MULTI-WAREHOUSE
* -------------------------------------------------------
DEFINE DATA
LOCAL USING SUPP-COPY
LOCAL USING PROD-COPY
LOCAL USING COMMON-COPY
*
LOCAL
  1 #SCREEN-MSG           (A78)
  1 #USER-ID              (A8)
  1 #NEW-PO-ID            (N10)
  1 #PO-NUMBER            (A15)
  1 #LINE-IDX             (N3)
  1 #MAX-LINES            (N3)    INIT <50>
  1 #SUPP-FOUND           (A1)
  1 #SUPP-MSG             (A60)
  1 #VALID-FLAG           (A1)
  1 #ERROR-MSG            (A60)
  1 #ORD-STR              (A15)
  1 #AUTO-APPROVE-LIMIT   (N11.2)  INIT <5000.00>
*
* PO LINE ARRAY
  1 #PO-LINES (50)
    2 #PL-PROD-ID         (N8)
    2 #PL-SKU             (A15)
    2 #PL-DESCRIPTION     (A60)
    2 #PL-QTY             (N6)
    2 #PL-UNIT-COST       (N9.2)
    2 #PL-LINE-TOTAL      (N11.2)
    2 #PL-WH-ID           (N4)
*
  1 #PO-SUBTOTAL          (N11.2)
  1 #PO-TAX               (N9.2)
  1 #PO-SHIPPING          (N9.2)
  1 #PO-TOTAL             (N11.2)
  1 #SUPP-LEAD-DAYS       (N3)
  1 #EXPECTED-DATE        (D)
  1 #CONFIG-VALUE         (A80)
  1 #CONFIG-NUM           (N11.2)
  1 #CONFIG-DATE          (D)
  1 #CONFIG-FLAG          (A1)
  1 #CONFIG-FOUND         (A1)
*
  1 POH-VIEW VIEW OF PO-HEADER-FILE
    2 POH-ID               (N10)
    2 POH-NUMBER           (A15)
    2 POH-SUPP-ID          (N8)
    2 POH-STATUS           (A2)
    2 POH-TYPE             (A2)
    2 POH-WH-ID            (N4)
    2 POH-DATE             (D)
    2 POH-EXPECTED-DATE    (D)
    2 POH-NUM-LINES        (N3)
    2 POH-SUBTOTAL         (N11.2)
    2 POH-TAX-AMT          (N9.2)
    2 POH-SHIPPING-AMT     (N9.2)
    2 POH-TOTAL-AMT        (N11.2)
    2 POH-CURRENCY         (A3)
    2 POH-NOTES            (A200)
    2 POH-CREATED-BY       (A8)
    2 POH-CREATED-DATE     (D)
    2 POH-APPROVED-BY      (A8)
    2 POH-APPROVED-DATE    (D)
*
  1 POL-VIEW VIEW OF PO-LINE-FILE
    2 POL-PO-ID            (N10)
    2 POL-LINE-NO          (N3)
    2 POL-PROD-ID          (N8)
    2 POL-SKU              (A15)
    2 POL-DESCRIPTION      (A60)
    2 POL-QTY-ORDERED      (N6)
    2 POL-QTY-RECEIVED     (N6)
    2 POL-UNIT-COST        (N9.2)
    2 POL-LINE-TOTAL       (N11.2)
    2 POL-STATUS           (A2)
    2 POL-WH-ID            (N4)
END-DEFINE
*
MOVE *USER TO #USER-ID
*
* STEP 1: SUPPLIER SELECTION
INPUT (IP=ON) WITH TEXT #SCREEN-MSG
  / 'RETAILCORE - PURCHASE ORDER ENTRY' (I)
  / '==================================' (I)
  /
  / 'SUPPLIER ID  :' SUPP-ID (AD=MI)
  / 'WAREHOUSE ID :' SUPP-WH-ID (AD=MI)
  / 'PO TYPE      :' SUPP-PO-TYPE (AD=MI) '(ST=STANDARD EM=EMERGENCY RP=REPLEN)'
  /
  / 'PF3=CANCEL ENTER=CONTINUE'
*
IF *PF-KEY = 'PF3'
  ESCAPE ROUTINE
END-IF
*
* VALIDATE SUPPLIER
1 #SD-DATA
  2 #SD-ID    (N8)
  2 #SD-NAME  (A60)
  2 #SD-STATUS (A1)
  2 #SD-TYPE  (A2)
  2 #SD-CONTACT (A40)
  2 #SD-PHONE (A15)
  2 #SD-EMAIL (A60)
1 #SD-ADDR
  2 #AD-LINE1 (A40)
  2 #AD-LINE2 (A40)
  2 #AD-CITY  (A30)
  2 #AD-STATE (A2)
  2 #AD-ZIP   (A10)
  2 #AD-CTRY  (A3)
1 #SD-TERMS
  2 #TM-PAY   (A10)
  2 #TM-DAYS  (N3)
  2 #TM-DISC  (N5.2)
  2 #TM-DDAYS (N3)
  2 #TM-LEAD  (N3)
  2 #TM-MIN   (N9.2)
  2 #TM-FRGHT (A3)
  2 #TM-CURR  (A3)
1 #SD-PERF
  2 #PF-RATE  (N3)
  2 #PF-OT    (N5.2)
  2 #PF-QL    (N5.2)
  2 #PF-FL    (N5.2)
  2 #PF-POS   (N6)
  2 #PF-AMT   (N11.2)
  2 #PF-DATE  (D)
*
CALLNAT 'SUPPGET' SUPP-ID #SD-DATA #SD-ADDR #SD-TERMS #SD-PERF
  #SUPP-FOUND #SUPP-MSG
IF #SUPP-FOUND NE 'Y'
  MOVE #SUPP-MSG TO #SCREEN-MSG
  ESCAPE ROUTINE
END-IF
IF #SD-STATUS NE 'A'
  MOVE 'SUPPLIER IS NOT ACTIVE' TO #SCREEN-MSG
  ESCAPE ROUTINE
END-IF
*
MOVE #TM-LEAD TO #SUPP-LEAD-DAYS
*
* STEP 2: LINE ITEM ENTRY
RESET #PO-SUBTOTAL
RESET #LINE-IDX
*
REPEAT
  ADD 1 TO #LINE-IDX
  IF #LINE-IDX > #MAX-LINES
    ESCAPE BOTTOM
  END-IF
*
  INPUT (IP=ON) WITH TEXT #SCREEN-MSG
    / 'PO LINE' #LINE-IDX (AD=OI) 'SUPPLIER:' #SD-NAME (AD=OI)
    / 'PRODUCT ID :' #PO-LINES.#PL-PROD-ID(#LINE-IDX) (AD=MI)
    / 'SKU        :' #PO-LINES.#PL-SKU(#LINE-IDX) (AD=MI)
    / 'QUANTITY   :' #PO-LINES.#PL-QTY(#LINE-IDX) (AD=MI)
    / 'UNIT COST  :' #PO-LINES.#PL-UNIT-COST(#LINE-IDX) (AD=MI)
    / 'WAREHOUSE  :' #PO-LINES.#PL-WH-ID(#LINE-IDX) (AD=MI)
    / 'PF3=DONE ADDING LINES  ENTER=ADD LINE'
*
  IF *PF-KEY = 'PF3'
    SUBTRACT 1 FROM #LINE-IDX
    ESCAPE BOTTOM
  END-IF
*
  IF #PO-LINES.#PL-PROD-ID(#LINE-IDX) = 0
      AND #PO-LINES.#PL-SKU(#LINE-IDX) = ' '
    SUBTRACT 1 FROM #LINE-IDX
    ESCAPE BOTTOM
  END-IF
*
  * VALIDATE PRODUCT
  1 #PV-ID (N8)
  1 #PV-NAME (A60)
  1 #PV-STATUS (A1)
  1 #PV-PRICE (N9.2)
  1 #PV-TAX (A4)
  CALLNAT 'SKUVAL'
    #PO-LINES.#PL-SKU(#LINE-IDX) ' '
    #PV-ID #PV-NAME #PV-STATUS #PV-PRICE #PV-TAX
    #VALID-FLAG #ERROR-MSG
  IF #VALID-FLAG NE 'Y' AND #PO-LINES.#PL-PROD-ID(#LINE-IDX) = 0
    MOVE #ERROR-MSG TO #SCREEN-MSG
    SUBTRACT 1 FROM #LINE-IDX
    ESCAPE TOP
  END-IF
  IF #PO-LINES.#PL-PROD-ID(#LINE-IDX) = 0
    MOVE #PV-ID TO #PO-LINES.#PL-PROD-ID(#LINE-IDX)
  END-IF
  MOVE #PV-NAME TO #PO-LINES.#PL-DESCRIPTION(#LINE-IDX)
*
  * DEFAULT WAREHOUSE
  IF #PO-LINES.#PL-WH-ID(#LINE-IDX) = 0
    MOVE SUPP-WH-ID TO #PO-LINES.#PL-WH-ID(#LINE-IDX)
  END-IF
*
  * CALCULATE LINE TOTAL
  COMPUTE #PO-LINES.#PL-LINE-TOTAL(#LINE-IDX) =
    #PO-LINES.#PL-QTY(#LINE-IDX)
    * #PO-LINES.#PL-UNIT-COST(#LINE-IDX)
  ADD #PO-LINES.#PL-LINE-TOTAL(#LINE-IDX) TO #PO-SUBTOTAL
*
  COMPRESS 'LINE' #LINE-IDX 'ADDED:' #PV-NAME INTO #SCREEN-MSG
END-REPEAT
*
IF #LINE-IDX = 0
  MOVE 'NO PO LINES ENTERED' TO #SCREEN-MSG
  ESCAPE ROUTINE
END-IF
*
* CALCULATE TOTALS
COMPUTE #PO-TOTAL = #PO-SUBTOTAL + #PO-TAX + #PO-SHIPPING
*
* CALCULATE EXPECTED DATE
MOVE *DATX TO #EXPECTED-DATE
ADD #SUPP-LEAD-DAYS TO #EXPECTED-DATE (D)
*
* STEP 3: CONFIRMATION
INPUT (IP=ON)
  / 'PO CONFIRMATION' (I)
  / '================' (I)
  / 'SUPPLIER  :' #SD-NAME (AD=OI)
  / 'LINES     :' #LINE-IDX (AD=OI)
  / 'SUBTOTAL  :' #PO-SUBTOTAL (AD=OI)
  / 'TOTAL     :' #PO-TOTAL (AD=OI)
  / 'EXPECTED  :' #EXPECTED-DATE (AD=OI)
  /
  / 'PF3=CANCEL  ENTER=CREATE PO'
*
IF *PF-KEY = 'PF3'
  ESCAPE ROUTINE
END-IF
*
* STEP 4: CREATE PO
CALLNAT 'SEQNON' 'PO' #NEW-PO-ID
COMPRESS 'PO-' #NEW-PO-ID INTO #PO-NUMBER LEAVING NO SPACE
*
STORE POH-VIEW
  POH-ID            := #NEW-PO-ID
  POH-NUMBER        := #PO-NUMBER
  POH-SUPP-ID       := SUPP-ID
  POH-STATUS        := 'DR'
  POH-TYPE          := SUPP-PO-TYPE
  POH-WH-ID         := SUPP-WH-ID
  POH-DATE          := *DATX
  POH-EXPECTED-DATE := #EXPECTED-DATE
  POH-NUM-LINES     := #LINE-IDX
  POH-SUBTOTAL      := #PO-SUBTOTAL
  POH-TAX-AMT       := #PO-TAX
  POH-SHIPPING-AMT  := #PO-SHIPPING
  POH-TOTAL-AMT     := #PO-TOTAL
  POH-CURRENCY      := #TM-CURR
  POH-CREATED-BY    := #USER-ID
  POH-CREATED-DATE  := *DATX
END-STORE
*
* STORE PO LINES
1 #LN (N3)
FOR #LN = 1 TO #LINE-IDX
  STORE POL-VIEW
    POL-PO-ID        := #NEW-PO-ID
    POL-LINE-NO      := #LN
    POL-PROD-ID      := #PO-LINES.#PL-PROD-ID(#LN)
    POL-SKU          := #PO-LINES.#PL-SKU(#LN)
    POL-DESCRIPTION  := #PO-LINES.#PL-DESCRIPTION(#LN)
    POL-QTY-ORDERED  := #PO-LINES.#PL-QTY(#LN)
    POL-QTY-RECEIVED := 0
    POL-UNIT-COST    := #PO-LINES.#PL-UNIT-COST(#LN)
    POL-LINE-TOTAL   := #PO-LINES.#PL-LINE-TOTAL(#LN)
    POL-STATUS       := 'PN'
    POL-WH-ID        := #PO-LINES.#PL-WH-ID(#LN)
  END-STORE
END-FOR
*
END OF TRANSACTION
*
* AUTO-APPROVE IF BELOW LIMIT
CALLNAT 'CONFIGN' 'PO.AUTO.APPROVE.LIMIT'
  #CONFIG-VALUE #CONFIG-NUM #CONFIG-DATE #CONFIG-FLAG #CONFIG-FOUND
IF #CONFIG-FOUND = 'Y'
  MOVE #CONFIG-NUM TO #AUTO-APPROVE-LIMIT
END-IF
IF #PO-TOTAL <= #AUTO-APPROVE-LIMIT
  CALLNAT 'POVAL' #NEW-PO-ID 'APRV' #USER-ID
    #VALID-FLAG #ERROR-MSG
END-IF
*
* AUDIT
MOVE #NEW-PO-ID TO #ORD-STR
CALLNAT 'AUDITN' 'PO' #ORD-STR 'C' 'PO'
  ' ' #PO-NUMBER 'PURCHASE ORDER CREATED'
*
COMPRESS 'PO' #PO-NUMBER 'CREATED SUCCESSFULLY'
  INTO #SCREEN-MSG
*
END
