* >Natural Source Code: POGET
* SUBPROGRAM: POGET - PURCHASE ORDER RETRIEVAL
* DESCRIPTION: RETRIEVES COMPLETE PO WITH HEADER AND LINES
* LIBRARY: RETAILCORE
* ADABAS FILES: 131 (PO-HEADER), 132 (PO-LINE)
* CREATED: 2001-10-20  A. GARCIA
* MODIFIED: 2012-05-15 - ADDED RECEIPT SUMMARY
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-PO-ID               (N10)
  1 P-PO-HEADER
    2 P-PH-ID             (N10)
    2 P-PH-NUMBER         (A15)
    2 P-PH-SUPP-ID        (N8)
    2 P-PH-STATUS         (A2)
    2 P-PH-TYPE           (A2)
    2 P-PH-WH-ID          (N4)
    2 P-PH-DATE           (D)
    2 P-PH-EXPECTED-DATE  (D)
    2 P-PH-NUM-LINES      (N3)
    2 P-PH-SUBTOTAL       (N11.2)
    2 P-PH-TAX            (N9.2)
    2 P-PH-SHIPPING       (N9.2)
    2 P-PH-TOTAL          (N11.2)
    2 P-PH-CURRENCY       (A3)
    2 P-PH-CREATED-BY     (A8)
    2 P-PH-APPROVED-BY    (A8)
  1 P-LINE-COUNT          (N3)
  1 P-LINES (50)
    2 P-PL-LINE-NO        (N3)
    2 P-PL-PROD-ID        (N8)
    2 P-PL-SKU            (A15)
    2 P-PL-DESC           (A60)
    2 P-PL-QTY-ORD        (N6)
    2 P-PL-QTY-RCV        (N6)
    2 P-PL-UNIT-COST      (N9.2)
    2 P-PL-LINE-TOTAL     (N11.2)
    2 P-PL-STATUS         (A2)
    2 P-PL-WH-ID          (N4)
  1 P-RECEIPT-SUMMARY
    2 P-RS-TOTAL-ORD      (N8)
    2 P-RS-TOTAL-RCV      (N8)
    2 P-RS-PCT-RECEIVED   (N5.2)
    2 P-RS-LINES-COMPLETE (N3)
  1 P-FOUND-FLAG          (A1)
  1 P-ERROR-MSG           (A60)
*
LOCAL
  1 #IDX                  (N3)
*
  1 PGH-VIEW VIEW OF PO-HEADER-FILE
    2 PGH-ID               (N10)
    2 PGH-NUMBER           (A15)
    2 PGH-SUPP-ID          (N8)
    2 PGH-STATUS           (A2)
    2 PGH-TYPE             (A2)
    2 PGH-WH-ID            (N4)
    2 PGH-DATE             (D)
    2 PGH-EXPECTED-DATE    (D)
    2 PGH-NUM-LINES        (N3)
    2 PGH-SUBTOTAL         (N11.2)
    2 PGH-TAX-AMT          (N9.2)
    2 PGH-SHIPPING-AMT     (N9.2)
    2 PGH-TOTAL-AMT        (N11.2)
    2 PGH-CURRENCY         (A3)
    2 PGH-CREATED-BY       (A8)
    2 PGH-APPROVED-BY      (A8)
*
  1 PGL-VIEW VIEW OF PO-LINE-FILE
    2 PGL-PO-ID            (N10)
    2 PGL-LINE-NO          (N3)
    2 PGL-PROD-ID          (N8)
    2 PGL-SKU              (A15)
    2 PGL-DESCRIPTION      (A60)
    2 PGL-QTY-ORDERED      (N6)
    2 PGL-QTY-RECEIVED     (N6)
    2 PGL-UNIT-COST        (N9.2)
    2 PGL-LINE-TOTAL       (N11.2)
    2 PGL-STATUS           (A2)
    2 PGL-WH-ID            (N4)
END-DEFINE
*
MOVE 'N' TO P-FOUND-FLAG
RESET P-ERROR-MSG
RESET P-LINE-COUNT
RESET P-RECEIPT-SUMMARY
*
* GET HEADER
FIND PGH-VIEW WITH PGH-ID = P-PO-ID
  IF NO RECORDS FOUND
    MOVE 'PO NOT FOUND' TO P-ERROR-MSG
    ESCAPE ROUTINE
  END-NOREC
  MOVE PGH-ID            TO P-PH-ID
  MOVE PGH-NUMBER        TO P-PH-NUMBER
  MOVE PGH-SUPP-ID       TO P-PH-SUPP-ID
  MOVE PGH-STATUS        TO P-PH-STATUS
  MOVE PGH-TYPE          TO P-PH-TYPE
  MOVE PGH-WH-ID         TO P-PH-WH-ID
  MOVE PGH-DATE          TO P-PH-DATE
  MOVE PGH-EXPECTED-DATE TO P-PH-EXPECTED-DATE
  MOVE PGH-NUM-LINES     TO P-PH-NUM-LINES
  MOVE PGH-SUBTOTAL      TO P-PH-SUBTOTAL
  MOVE PGH-TAX-AMT       TO P-PH-TAX
  MOVE PGH-SHIPPING-AMT  TO P-PH-SHIPPING
  MOVE PGH-TOTAL-AMT     TO P-PH-TOTAL
  MOVE PGH-CURRENCY      TO P-PH-CURRENCY
  MOVE PGH-CREATED-BY    TO P-PH-CREATED-BY
  MOVE PGH-APPROVED-BY   TO P-PH-APPROVED-BY
  ESCAPE BOTTOM
END-FIND
*
* GET LINES
RESET #IDX
READ PGL-VIEW BY PGL-PO-ID = P-PO-ID
  IF PGL-PO-ID NE P-PO-ID
    ESCAPE BOTTOM
  END-IF
  ADD 1 TO #IDX
  IF #IDX > 50
    ESCAPE BOTTOM
  END-IF
  MOVE PGL-LINE-NO      TO P-LINES.P-PL-LINE-NO(#IDX)
  MOVE PGL-PROD-ID      TO P-LINES.P-PL-PROD-ID(#IDX)
  MOVE PGL-SKU          TO P-LINES.P-PL-SKU(#IDX)
  MOVE PGL-DESCRIPTION  TO P-LINES.P-PL-DESC(#IDX)
  MOVE PGL-QTY-ORDERED  TO P-LINES.P-PL-QTY-ORD(#IDX)
  MOVE PGL-QTY-RECEIVED TO P-LINES.P-PL-QTY-RCV(#IDX)
  MOVE PGL-UNIT-COST    TO P-LINES.P-PL-UNIT-COST(#IDX)
  MOVE PGL-LINE-TOTAL   TO P-LINES.P-PL-LINE-TOTAL(#IDX)
  MOVE PGL-STATUS       TO P-LINES.P-PL-STATUS(#IDX)
  MOVE PGL-WH-ID        TO P-LINES.P-PL-WH-ID(#IDX)
*
  * ACCUMULATE RECEIPT SUMMARY
  ADD PGL-QTY-ORDERED  TO P-RS-TOTAL-ORD
  ADD PGL-QTY-RECEIVED TO P-RS-TOTAL-RCV
  IF PGL-QTY-RECEIVED >= PGL-QTY-ORDERED
    ADD 1 TO P-RS-LINES-COMPLETE
  END-IF
END-READ
*
MOVE #IDX TO P-LINE-COUNT
*
* CALCULATE RECEIPT PERCENTAGE
IF P-RS-TOTAL-ORD > 0
  COMPUTE P-RS-PCT-RECEIVED =
    (P-RS-TOTAL-RCV / P-RS-TOTAL-ORD) * 100
END-IF
*
MOVE 'Y' TO P-FOUND-FLAG
*
END
